xsession/openocd/svd/dspic30f5011.svd
<?xml version='1.0' encoding='utf-8'?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Microchip</vendor>
  <vendorID>Microchip</vendorID>
  <name>dsPIC30F5011</name>
  <series>dsPIC30F</series>
  <version>1.0</version>
  <description>Microchip dsPIC30F5011 dsPIC Digital Signal Controller</description>
  <licenseText>Derived from Microchip Device Family Pack data; see metadata.</licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>16</width>
  <size>16</size>
  <access>read-write</access>
  <resetValue>0x0</resetValue>
  <resetMask>0xffff</resetMask>
  <peripherals>
    <peripheral>
      <name>SFR</name>
      <description>Special Function Register data space</description>
      <groupName>SFR</groupName>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x774</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>INT0Interrupt</name>
        <description>INT0 - External Interrupt 0</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>IC1Interrupt</name>
        <description>IC1 - Input Capture 1</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>OC1Interrupt</name>
        <description>OC1 - Output Compare 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>T1Interrupt</name>
        <description>T1 - Timer1</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>IC2Interrupt</name>
        <description>IC2 - Input Capture 2</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>OC2Interrupt</name>
        <description>OC2 - Output Compare 2</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>T2Interrupt</name>
        <description>T2 - Timer2</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>T3Interrupt</name>
        <description>T3 - Timer3</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>SPI1Interrupt</name>
        <description>SPI1 - SPI1 Transfer Done</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>U1RXInterrupt</name>
        <description>U1RX - UART1 Receiver</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>NVMInterrupt</name>
        <description>NVM Write Complete Interrupt</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>SI2CInterrupt</name>
        <description>SI2C1 - I2C1 Slave Events</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>MI2CInterrupt</name>
        <description>MI2C1 - I2C1 Master Events</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>CNInterrupt</name>
        <description>CN -  Change Notification Interrupt</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>INT1Interrupt</name>
        <description>INT1 - External Interrupt 1</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>IC7Interrupt</name>
        <description>IC7 - Input Capture 7</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>IC8Interrupt</name>
        <description>IC8 - Input Capture 8</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>OC3Interrupt</name>
        <description>OC3 - Output Compare 3</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>OC4Interrupt</name>
        <description>OC4 - Output Compare 4</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>T4Interrupt</name>
        <description>T4 - Timer4</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>T5Interrupt</name>
        <description>T5 - Timer5</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>INT2Interrupt</name>
        <description>INT2 - External Interrupt 2</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>U2RXInterrupt</name>
        <description>U2RX - UART2 Receiver</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>U2TXInterrupt</name>
        <description>U2TX - UART2 Transmitter</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>SPI2Interrupt</name>
        <description>SPI2 - SPI2 Transfer Done</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>C1Interrupt</name>
        <description>C1 - ECAN1 Event</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>IC3Interrupt</name>
        <description>IC3 - Input Capture 3</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>IC4Interrupt</name>
        <description>IC4 - Input Capture 4</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>IC5Interrupt</name>
        <description>IC5 - Input Capture 5</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>IC6Interrupt</name>
        <description>IC5 - Input Capture 6</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>OC5Interrupt</name>
        <description>OC5 - Output Compare 5</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>OC6Interrupt</name>
        <description>OC6 - Output Compare 6</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>OC7Interrupt</name>
        <description>OC7 - Output Compare 7</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>OC8Interrupt</name>
        <description>OC8 - Output Compare 8</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>INT3Interrupt</name>
        <description>INT3 - External Interrupt 3</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>INT4Interrupt</name>
        <description>INT4 - External Interrupt 4</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>C2Interrupt</name>
        <description>C2 - ECAN2 Event</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>PWMInterrupt</name>
        <description>PWM - PWM Period Match</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>QEIInterrupt</name>
        <description>QEI - Position Counter Compare</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>DCIInterrupt</name>
        <description>DCI - Interrupt</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>LVDInterrupt</name>
        <description>LVD - Interrupt</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>FLTAInterrupt</name>
        <description>FLTA - MCPWM Fault A</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>FLTBInterrupt</name>
        <description>FLTB - MCPWM Fault B</description>
        <value>44</value>
      </interrupt>
      <registers>
        <register>
          <name>WREG0</name>
          <displayName>WREG0</displayName>
          <description>WREG0</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG0</name>
              <description>WREG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG1</name>
          <displayName>WREG1</displayName>
          <description>WREG1</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG1</name>
              <description>WREG1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG2</name>
          <displayName>WREG2</displayName>
          <description>WREG2</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG2</name>
              <description>WREG2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG3</name>
          <displayName>WREG3</displayName>
          <description>WREG3</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG3</name>
              <description>WREG3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG4</name>
          <displayName>WREG4</displayName>
          <description>WREG4</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG4</name>
              <description>WREG4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM0EIDH</name>
          <displayName>C2RXM0EIDH</displayName>
          <description>C2RXM0EIDH</description>
          <addressOffset>0xa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG6</name>
          <displayName>WREG6</displayName>
          <description>WREG6</description>
          <addressOffset>0xc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG6</name>
              <description>WREG6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG7</name>
          <displayName>WREG7</displayName>
          <description>WREG7</description>
          <addressOffset>0xe</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG7</name>
              <description>WREG7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG8</name>
          <displayName>WREG8</displayName>
          <description>WREG8</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG8</name>
              <description>WREG8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG9</name>
          <displayName>WREG9</displayName>
          <description>WREG9</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG9</name>
              <description>WREG9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG10</name>
          <displayName>WREG10</displayName>
          <description>WREG10</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG10</name>
              <description>WREG10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG11</name>
          <displayName>WREG11</displayName>
          <description>WREG11</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG11</name>
              <description>WREG11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG12</name>
          <displayName>WREG12</displayName>
          <description>WREG12</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG12</name>
              <description>WREG12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG13</name>
          <displayName>WREG13</displayName>
          <description>WREG13</description>
          <addressOffset>0x1a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG13</name>
              <description>WREG13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG14</name>
          <displayName>WREG14</displayName>
          <description>WREG14</description>
          <addressOffset>0x1c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG14</name>
              <description>WREG14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG15</name>
          <displayName>WREG15</displayName>
          <description>WREG15</description>
          <addressOffset>0x1e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>WREG15</name>
              <description>WREG15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLIM</name>
          <displayName>SPLIM</displayName>
          <description>SPLIM</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPLIM</name>
              <description>SPLIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCAL</name>
          <displayName>ACCAL</displayName>
          <description>ACCAL</description>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCAL</name>
              <description>ACCAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCAH</name>
          <displayName>ACCAH</displayName>
          <description>ACCAH</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCAH</name>
              <description>ACCAH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCAU</name>
          <displayName>ACCAU</displayName>
          <description>ACCAU</description>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff00</resetMask>
          <fields>
            <field>
              <name>ACCAU</name>
              <description>ACCAU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCBL</name>
          <displayName>ACCBL</displayName>
          <description>ACCBL</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCBL</name>
              <description>ACCBL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCBH</name>
          <displayName>ACCBH</displayName>
          <description>ACCBH</description>
          <addressOffset>0x2a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCBH</name>
              <description>ACCBH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCBU</name>
          <displayName>ACCBU</displayName>
          <description>ACCBU</description>
          <addressOffset>0x2c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff00</resetMask>
          <fields>
            <field>
              <name>ACCBU</name>
              <description>ACCBU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCL</name>
          <displayName>PCL</displayName>
          <description>PCL</description>
          <addressOffset>0x2e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PCL</name>
              <description>PCL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCH</name>
          <displayName>PCH</displayName>
          <description>PCH</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>PCH</name>
              <description>PCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBLPAG</name>
          <displayName>TBLPAG</displayName>
          <description>TBLPAG</description>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>TBLPAG</name>
              <description>TBLPAG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSVPAG</name>
          <displayName>PSVPAG</displayName>
          <description>PSVPAG</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>PSVPAG</name>
              <description>PSVPAG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
