xsession/openocd/svd/dspic30f5011.svd
        <register>
          <name>RCOUNT</name>
          <displayName>RCOUNT</displayName>
          <description>RCOUNT</description>
          <addressOffset>0x36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RCOUNT</name>
              <description>RCOUNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOUNT</name>
          <displayName>DCOUNT</displayName>
          <description>DCOUNT</description>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DCOUNT</name>
              <description>DCOUNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOSTARTL</name>
          <displayName>DOSTARTL</displayName>
          <description>DOSTARTL</description>
          <addressOffset>0x3a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DOSTARTL</name>
              <description>DOSTARTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOSTARTH</name>
          <displayName>DOSTARTH</displayName>
          <description>DOSTARTH</description>
          <addressOffset>0x3c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DOSTARTH</name>
              <description>DOSTARTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOENDL</name>
          <displayName>DOENDL</displayName>
          <description>DOENDL</description>
          <addressOffset>0x3e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DOENDL</name>
              <description>DOENDL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOENDH</name>
          <displayName>DOENDH</displayName>
          <description>DOENDH</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DOENDH</name>
              <description>DOENDH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>SR</description>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>C</name>
              <description>C</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CORCON</name>
          <displayName>CORCON</displayName>
          <description>CORCON</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0x1fff</resetMask>
          <fields>
            <field>
              <name>IF</name>
              <description>IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MODCON</name>
          <displayName>MODCON</displayName>
          <description>MODCON</description>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xcfff</resetMask>
          <fields>
            <field>
              <name>XWM</name>
              <description>XWM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XMODSRT</name>
          <displayName>XMODSRT</displayName>
          <description>XMODSRT</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>XS</name>
              <description>XS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XMODEND</name>
          <displayName>XMODEND</displayName>
          <description>XMODEND</description>
          <addressOffset>0x4a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>XE</name>
              <description>XE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>YMODSRT</name>
          <displayName>YMODSRT</displayName>
          <description>YMODSRT</description>
          <addressOffset>0x4c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>YS</name>
              <description>YS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>YMODEND</name>
          <displayName>YMODEND</displayName>
          <description>YMODEND</description>
          <addressOffset>0x4e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>YE</name>
              <description>YE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XBREV</name>
          <displayName>XBREV</displayName>
          <description>XBREV</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>XB</name>
              <description>XB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DISICNT</name>
          <displayName>DISICNT</displayName>
          <description>DISICNT</description>
          <addressOffset>0x52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>DISICNT</name>
              <description>DISICNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCON1</name>
          <displayName>INTCON1</displayName>
          <description>INTCON1</description>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x871e</resetMask>
          <fields>
            <field>
              <name>OSCFAIL</name>
              <description>OSCFAIL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCON2</name>
          <displayName>INTCON2</displayName>
          <description>INTCON2</description>
          <addressOffset>0x82</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc01f</resetMask>
          <fields>
            <field>
              <name>INT0EP</name>
              <description>INT0EP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0</name>
          <displayName>IFS0</displayName>
          <description>IFS0</description>
          <addressOffset>0x84</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>INT0IF</name>
              <description>INT0IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1</name>
          <displayName>IFS1</displayName>
          <description>IFS1</description>
          <addressOffset>0x86</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>INT1IF</name>
              <description>INT1IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2</name>
          <displayName>IFS2</displayName>
          <description>IFS2</description>
          <addressOffset>0x88</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x67f</resetMask>
          <fields>
            <field>
              <name>OC5IF</name>
              <description>OC5IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0</name>
          <displayName>IEC0</displayName>
          <description>IEC0</description>
          <addressOffset>0x8c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>INT0IE</name>
              <description>INT0IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1</name>
          <displayName>IEC1</displayName>
          <description>IEC1</description>
          <addressOffset>0x8e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>INT1IE</name>
              <description>INT1IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2</name>
          <displayName>IEC2</displayName>
          <description>IEC2</description>
          <addressOffset>0x90</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x67f</resetMask>
          <fields>
            <field>
              <name>OC5IE</name>
              <description>OC5IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0</name>
          <displayName>IPC0</displayName>
          <description>IPC0</description>
          <addressOffset>0x94</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>INT0IP</name>
              <description>INT0IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1</name>
          <displayName>IPC1</displayName>
          <description>IPC1</description>
          <addressOffset>0x96</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>IC2IP</name>
              <description>IC2IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2</name>
          <displayName>IPC2</displayName>
          <description>IPC2</description>
          <addressOffset>0x98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>SPI1IP</name>
              <description>SPI1IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3</name>
          <displayName>IPC3</displayName>
          <description>IPC3</description>
          <addressOffset>0x9a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>NVMIP</name>
              <description>NVMIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4</name>
          <displayName>IPC4</displayName>
          <description>IPC4</description>
          <addressOffset>0x9c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>INT1IP</name>
              <description>INT1IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5</name>
          <displayName>IPC5</displayName>
          <description>IPC5</description>
          <addressOffset>0x9e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>OC4IP</name>
              <description>OC4IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6</name>
          <displayName>IPC6</displayName>
          <description>IPC6</description>
          <addressOffset>0xa0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>U2RXIP</name>
              <description>U2RXIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7</name>
          <displayName>IPC7</displayName>
          <description>IPC7</description>
          <addressOffset>0xa2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>IC3IP</name>
              <description>IC3IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8</name>
          <displayName>IPC8</displayName>
          <description>IPC8</description>
          <addressOffset>0xa4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>OC5IP</name>
              <description>OC5IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9</name>
          <displayName>IPC9</displayName>
          <description>IPC9</description>
          <addressOffset>0xa6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x444</resetValue>
          <resetMask>0x777</resetMask>
          <fields>
            <field>
              <name>INT3IP</name>
              <description>INT3IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10</name>
          <displayName>IPC10</displayName>
          <description>IPC10</description>
          <addressOffset>0xa8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x440</resetValue>
          <resetMask>0x770</resetMask>
          <fields>
            <field>
              <name>DCIIP</name>
              <description>DCIIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTTREG</name>
          <displayName>INTTREG</displayName>
          <description>INTTREG</description>
          <addressOffset>0xb0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xcf3f</resetMask>
          <fields>
            <field>
              <name>VECNUM</name>
              <description>VECNUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNEN1</name>
          <displayName>CNEN1</displayName>
          <description>CNEN1</description>
          <addressOffset>0xc0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CN0IE</name>
              <description>CN0IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNEN2</name>
          <displayName>CNEN2</displayName>
          <description>CNEN2</description>
          <addressOffset>0xc2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>CN16IE</name>
              <description>CN16IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPU1</name>
          <displayName>CNPU1</displayName>
          <description>CNPU1</description>
          <addressOffset>0xc4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CN0PUE</name>
              <description>CN0PUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPU2</name>
          <displayName>CNPU2</displayName>
          <description>CNPU2</description>
          <addressOffset>0xc6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>CN16PUE</name>
              <description>CN16PUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1</name>
          <displayName>TMR1</displayName>
          <description>TMR1</description>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR1</name>
              <description>TMR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
