xsession/openocd/svd/dspic30f5011.svd
        <register>
          <name>PR1</name>
          <displayName>PR1</displayName>
          <description>PR1</description>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR1</name>
              <description>PR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CON</name>
          <displayName>T1CON</displayName>
          <description>T1CON</description>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa076</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR2</name>
          <displayName>TMR2</displayName>
          <description>TMR2</description>
          <addressOffset>0x106</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR2</name>
              <description>TMR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR3HLD</name>
          <displayName>TMR3HLD</displayName>
          <description>TMR3HLD</description>
          <addressOffset>0x108</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR3HLD</name>
              <description>TMR3HLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR3</name>
          <displayName>TMR3</displayName>
          <description>TMR3</description>
          <addressOffset>0x10a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR3</name>
              <description>TMR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR2</name>
          <displayName>PR2</displayName>
          <description>PR2</description>
          <addressOffset>0x10c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR2</name>
              <description>PR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR3</name>
          <displayName>PR3</displayName>
          <description>PR3</description>
          <addressOffset>0x10e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR3</name>
              <description>PR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T2CON</name>
          <displayName>T2CON</displayName>
          <description>T2CON</description>
          <addressOffset>0x110</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa07a</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T3CON</name>
          <displayName>T3CON</displayName>
          <description>T3CON</description>
          <addressOffset>0x112</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa072</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR4</name>
          <displayName>TMR4</displayName>
          <description>TMR4</description>
          <addressOffset>0x114</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR4</name>
              <description>TMR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR5HLD</name>
          <displayName>TMR5HLD</displayName>
          <description>TMR5HLD</description>
          <addressOffset>0x116</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR5HLD</name>
              <description>TMR5HLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR5</name>
          <displayName>TMR5</displayName>
          <description>TMR5</description>
          <addressOffset>0x118</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR5</name>
              <description>TMR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR4</name>
          <displayName>PR4</displayName>
          <description>PR4</description>
          <addressOffset>0x11a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR4</name>
              <description>PR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR5</name>
          <displayName>PR5</displayName>
          <description>PR5</description>
          <addressOffset>0x11c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR5</name>
              <description>PR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T4CON</name>
          <displayName>T4CON</displayName>
          <description>T4CON</description>
          <addressOffset>0x11e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T5CON</name>
          <displayName>T5CON</displayName>
          <description>T5CON</description>
          <addressOffset>0x120</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1BUF</name>
          <displayName>IC1BUF</displayName>
          <description>IC1BUF</description>
          <addressOffset>0x140</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC1BUF</name>
              <description>IC1BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1CON</name>
          <displayName>IC1CON</displayName>
          <description>IC1CON</description>
          <addressOffset>0x142</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2BUF</name>
          <displayName>IC2BUF</displayName>
          <description>IC2BUF</description>
          <addressOffset>0x144</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC2BUF</name>
              <description>IC2BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2CON</name>
          <displayName>IC2CON</displayName>
          <description>IC2CON</description>
          <addressOffset>0x146</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3BUF</name>
          <displayName>IC3BUF</displayName>
          <description>IC3BUF</description>
          <addressOffset>0x148</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC3BUF</name>
              <description>IC3BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3CON</name>
          <displayName>IC3CON</displayName>
          <description>IC3CON</description>
          <addressOffset>0x14a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC4BUF</name>
          <displayName>IC4BUF</displayName>
          <description>IC4BUF</description>
          <addressOffset>0x14c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC4BUF</name>
              <description>IC4BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC4CON</name>
          <displayName>IC4CON</displayName>
          <description>IC4CON</description>
          <addressOffset>0x14e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC5BUF</name>
          <displayName>IC5BUF</displayName>
          <description>IC5BUF</description>
          <addressOffset>0x150</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC5BUF</name>
              <description>IC5BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC5CON</name>
          <displayName>IC5CON</displayName>
          <description>IC5CON</description>
          <addressOffset>0x152</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC6BUF</name>
          <displayName>IC6BUF</displayName>
          <description>IC6BUF</description>
          <addressOffset>0x154</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC6BUF</name>
              <description>IC6BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC6CON</name>
          <displayName>IC6CON</displayName>
          <description>IC6CON</description>
          <addressOffset>0x156</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC7BUF</name>
          <displayName>IC7BUF</displayName>
          <description>IC7BUF</description>
          <addressOffset>0x158</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC7BUF</name>
              <description>IC7BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC7CON</name>
          <displayName>IC7CON</displayName>
          <description>IC7CON</description>
          <addressOffset>0x15a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC8BUF</name>
          <displayName>IC8BUF</displayName>
          <description>IC8BUF</description>
          <addressOffset>0x15c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC8BUF</name>
              <description>IC8BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC8CON</name>
          <displayName>IC8CON</displayName>
          <description>IC8CON</description>
          <addressOffset>0x15e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1RS</name>
          <displayName>OC1RS</displayName>
          <description>OC1RS</description>
          <addressOffset>0x180</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC1RS</name>
              <description>OC1RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1R</name>
          <displayName>OC1R</displayName>
          <description>OC1R</description>
          <addressOffset>0x182</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC1R</name>
              <description>OC1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1CON</name>
          <displayName>OC1CON</displayName>
          <description>OC1CON</description>
          <addressOffset>0x184</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2RS</name>
          <displayName>OC2RS</displayName>
          <description>OC2RS</description>
          <addressOffset>0x186</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC2RS</name>
              <description>OC2RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2R</name>
          <displayName>OC2R</displayName>
          <description>OC2R</description>
          <addressOffset>0x188</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC2R</name>
              <description>OC2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2CON</name>
          <displayName>OC2CON</displayName>
          <description>OC2CON</description>
          <addressOffset>0x18a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3RS</name>
          <displayName>OC3RS</displayName>
          <description>OC3RS</description>
          <addressOffset>0x18c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC3RS</name>
              <description>OC3RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3R</name>
          <displayName>OC3R</displayName>
          <description>OC3R</description>
          <addressOffset>0x18e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC3R</name>
              <description>OC3R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
