xsession/openocd/svd/dspic30f5011.svd
        <register>
          <name>OC3CON</name>
          <displayName>OC3CON</displayName>
          <description>OC3CON</description>
          <addressOffset>0x190</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4RS</name>
          <displayName>OC4RS</displayName>
          <description>OC4RS</description>
          <addressOffset>0x192</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC4RS</name>
              <description>OC4RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4R</name>
          <displayName>OC4R</displayName>
          <description>OC4R</description>
          <addressOffset>0x194</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC4R</name>
              <description>OC4R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4CON</name>
          <displayName>OC4CON</displayName>
          <description>OC4CON</description>
          <addressOffset>0x196</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC5RS</name>
          <displayName>OC5RS</displayName>
          <description>OC5RS</description>
          <addressOffset>0x198</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC5RS</name>
              <description>OC5RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC5R</name>
          <displayName>OC5R</displayName>
          <description>OC5R</description>
          <addressOffset>0x19a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC5R</name>
              <description>OC5R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC5CON</name>
          <displayName>OC5CON</displayName>
          <description>OC5CON</description>
          <addressOffset>0x19c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6RS</name>
          <displayName>OC6RS</displayName>
          <description>OC6RS</description>
          <addressOffset>0x19e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC6RS</name>
              <description>OC6RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6R</name>
          <displayName>OC6R</displayName>
          <description>OC6R</description>
          <addressOffset>0x1a0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC6R</name>
              <description>OC6R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6CON</name>
          <displayName>OC6CON</displayName>
          <description>OC6CON</description>
          <addressOffset>0x1a2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7RS</name>
          <displayName>OC7RS</displayName>
          <description>OC7RS</description>
          <addressOffset>0x1a4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC7RS</name>
              <description>OC7RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7R</name>
          <displayName>OC7R</displayName>
          <description>OC7R</description>
          <addressOffset>0x1a6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC7R</name>
              <description>OC7R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7CON</name>
          <displayName>OC7CON</displayName>
          <description>OC7CON</description>
          <addressOffset>0x1a8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8RS</name>
          <displayName>OC8RS</displayName>
          <description>OC8RS</description>
          <addressOffset>0x1aa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC8RS</name>
              <description>OC8RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8R</name>
          <displayName>OC8R</displayName>
          <description>OC8R</description>
          <addressOffset>0x1ac</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC8R</name>
              <description>OC8R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8CON</name>
          <displayName>OC8CON</displayName>
          <description>OC8CON</description>
          <addressOffset>0x1ae</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CRCV</name>
          <displayName>I2CRCV</displayName>
          <description>I2CRCV</description>
          <addressOffset>0x200</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>I2CRCV</name>
              <description>I2CRCV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CTRN</name>
          <displayName>I2CTRN</displayName>
          <description>I2CTRN</description>
          <addressOffset>0x202</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>I2CTRN</name>
              <description>I2CTRN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CBRG</name>
          <displayName>I2CBRG</displayName>
          <description>I2CBRG</description>
          <addressOffset>0x204</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>I2CBRG</name>
              <description>I2CBRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CCON</name>
          <displayName>I2CCON</displayName>
          <description>I2CCON</description>
          <addressOffset>0x206</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>SEN</name>
              <description>SEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CSTAT</name>
          <displayName>I2CSTAT</displayName>
          <description>I2CSTAT</description>
          <addressOffset>0x208</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc7ff</resetMask>
          <fields>
            <field>
              <name>TBF</name>
              <description>TBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CADD</name>
          <displayName>I2CADD</displayName>
          <description>I2CADD</description>
          <addressOffset>0x20a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>I2CADD</name>
              <description>I2CADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1MODE</name>
          <displayName>U1MODE</displayName>
          <description>U1MODE</description>
          <addressOffset>0x20c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa4e7</resetMask>
          <fields>
            <field>
              <name>STSEL</name>
              <description>STSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1STA</name>
          <displayName>U1STA</displayName>
          <description>U1STA</description>
          <addressOffset>0x20e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0x8fff</resetMask>
          <fields>
            <field>
              <name>URXDA</name>
              <description>URXDA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1TXREG</name>
          <displayName>U1TXREG</displayName>
          <description>U1TXREG</description>
          <addressOffset>0x210</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>U1TXREG</name>
              <description>U1TXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1RXREG</name>
          <displayName>U1RXREG</displayName>
          <description>U1RXREG</description>
          <addressOffset>0x212</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>U1RXREG</name>
              <description>U1RXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BRG</name>
          <displayName>U1BRG</displayName>
          <description>U1BRG</description>
          <addressOffset>0x214</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRG</name>
              <description>BRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2MODE</name>
          <displayName>U2MODE</displayName>
          <description>U2MODE</description>
          <addressOffset>0x216</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa0e7</resetMask>
          <fields>
            <field>
              <name>STSEL</name>
              <description>STSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2STA</name>
          <displayName>U2STA</displayName>
          <description>U2STA</description>
          <addressOffset>0x218</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0x8fff</resetMask>
          <fields>
            <field>
              <name>URXDA</name>
              <description>URXDA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2TXREG</name>
          <displayName>U2TXREG</displayName>
          <description>U2TXREG</description>
          <addressOffset>0x21a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>U2TXREG</name>
              <description>U2TXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2RXREG</name>
          <displayName>U2RXREG</displayName>
          <description>U2RXREG</description>
          <addressOffset>0x21c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>U2RXREG</name>
              <description>U2RXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2BRG</name>
          <displayName>U2BRG</displayName>
          <description>U2BRG</description>
          <addressOffset>0x21e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRG</name>
              <description>BRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1STAT</name>
          <displayName>SPI1STAT</displayName>
          <description>SPI1STAT</description>
          <addressOffset>0x220</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa043</resetMask>
          <fields>
            <field>
              <name>SPIRBF</name>
              <description>SPIRBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON</name>
          <displayName>SPI1CON</displayName>
          <description>SPI1CON</description>
          <addressOffset>0x222</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x6fff</resetMask>
          <fields>
            <field>
              <name>PPRE0</name>
              <description>PPRE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1BUF</name>
          <displayName>SPI1BUF</displayName>
          <description>SPI1BUF</description>
          <addressOffset>0x224</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPI1BUF</name>
              <description>SPI1BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2STAT</name>
          <displayName>SPI2STAT</displayName>
          <description>SPI2STAT</description>
          <addressOffset>0x226</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa043</resetMask>
          <fields>
            <field>
              <name>SPIRBF</name>
              <description>SPIRBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CON</name>
          <displayName>SPI2CON</displayName>
          <description>SPI2CON</description>
          <addressOffset>0x228</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x6fff</resetMask>
          <fields>
            <field>
              <name>PPRE0</name>
              <description>PPRE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2BUF</name>
          <displayName>SPI2BUF</displayName>
          <description>SPI2BUF</description>
          <addressOffset>0x22a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPI2BUF</name>
              <description>SPI2BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCICON1</name>
          <displayName>DCICON1</displayName>
          <description>DCICON1</description>
          <addressOffset>0x240</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xafe3</resetMask>
          <fields>
            <field>
              <name>COFSM</name>
              <description>COFSM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCICON2</name>
          <displayName>DCICON2</displayName>
          <description>DCICON2</description>
          <addressOffset>0x242</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xdef</resetMask>
          <fields>
            <field>
              <name>WS</name>
              <description>WS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
