xsession/openocd/svd/dspic30f5011.svd
        <register>
          <name>DCICON3</name>
          <displayName>DCICON3</displayName>
          <description>DCICON3</description>
          <addressOffset>0x244</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>BCG</name>
              <description>BCG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCISTAT</name>
          <displayName>DCISTAT</displayName>
          <description>DCISTAT</description>
          <addressOffset>0x246</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf0f</resetMask>
          <fields>
            <field>
              <name>TMPTY</name>
              <description>TMPTY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCON</name>
          <displayName>TSCON</displayName>
          <description>TSCON</description>
          <addressOffset>0x248</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TSE0</name>
              <description>TSE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSCON</name>
          <displayName>RSCON</displayName>
          <description>RSCON</description>
          <addressOffset>0x24c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RSE0</name>
              <description>RSE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBUF0</name>
          <displayName>RXBUF0</displayName>
          <description>RXBUF0</description>
          <addressOffset>0x250</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXBUF0</name>
              <description>RXBUF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBUF1</name>
          <displayName>RXBUF1</displayName>
          <description>RXBUF1</description>
          <addressOffset>0x252</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXBUF1</name>
              <description>RXBUF1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBUF2</name>
          <displayName>RXBUF2</displayName>
          <description>RXBUF2</description>
          <addressOffset>0x254</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXBUF2</name>
              <description>RXBUF2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBUF3</name>
          <displayName>RXBUF3</displayName>
          <description>RXBUF3</description>
          <addressOffset>0x256</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXBUF3</name>
              <description>RXBUF3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF0</name>
          <displayName>TXBUF0</displayName>
          <description>TXBUF0</description>
          <addressOffset>0x258</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TXBUF0</name>
              <description>TXBUF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF1</name>
          <displayName>TXBUF1</displayName>
          <description>TXBUF1</description>
          <addressOffset>0x25a</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TXBUF1</name>
              <description>TXBUF1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF2</name>
          <displayName>TXBUF2</displayName>
          <description>TXBUF2</description>
          <addressOffset>0x25c</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TXBUF2</name>
              <description>TXBUF2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF3</name>
          <displayName>TXBUF3</displayName>
          <description>TXBUF3</description>
          <addressOffset>0x25e</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TXBUF3</name>
              <description>TXBUF3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF0</name>
          <displayName>ADCBUF0</displayName>
          <description>ADCBUF0</description>
          <addressOffset>0x280</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF0</name>
              <description>ADCBUF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF1</name>
          <displayName>ADCBUF1</displayName>
          <description>ADCBUF1</description>
          <addressOffset>0x282</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF1</name>
              <description>ADCBUF1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF2</name>
          <displayName>ADCBUF2</displayName>
          <description>ADCBUF2</description>
          <addressOffset>0x284</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF2</name>
              <description>ADCBUF2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF3</name>
          <displayName>ADCBUF3</displayName>
          <description>ADCBUF3</description>
          <addressOffset>0x286</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF3</name>
              <description>ADCBUF3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF4</name>
          <displayName>ADCBUF4</displayName>
          <description>ADCBUF4</description>
          <addressOffset>0x288</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF4</name>
              <description>ADCBUF4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF5</name>
          <displayName>ADCBUF5</displayName>
          <description>ADCBUF5</description>
          <addressOffset>0x28a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF5</name>
              <description>ADCBUF5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF6</name>
          <displayName>ADCBUF6</displayName>
          <description>ADCBUF6</description>
          <addressOffset>0x28c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF6</name>
              <description>ADCBUF6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF7</name>
          <displayName>ADCBUF7</displayName>
          <description>ADCBUF7</description>
          <addressOffset>0x28e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF7</name>
              <description>ADCBUF7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF8</name>
          <displayName>ADCBUF8</displayName>
          <description>ADCBUF8</description>
          <addressOffset>0x290</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF8</name>
              <description>ADCBUF8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF9</name>
          <displayName>ADCBUF9</displayName>
          <description>ADCBUF9</description>
          <addressOffset>0x292</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF9</name>
              <description>ADCBUF9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUFA</name>
          <displayName>ADCBUFA</displayName>
          <description>ADCBUFA</description>
          <addressOffset>0x294</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUFA</name>
              <description>ADCBUFA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUFB</name>
          <displayName>ADCBUFB</displayName>
          <description>ADCBUFB</description>
          <addressOffset>0x296</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUFB</name>
              <description>ADCBUFB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUFC</name>
          <displayName>ADCBUFC</displayName>
          <description>ADCBUFC</description>
          <addressOffset>0x298</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUFC</name>
              <description>ADCBUFC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUFD</name>
          <displayName>ADCBUFD</displayName>
          <description>ADCBUFD</description>
          <addressOffset>0x29a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUFD</name>
              <description>ADCBUFD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUFE</name>
          <displayName>ADCBUFE</displayName>
          <description>ADCBUFE</description>
          <addressOffset>0x29c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUFE</name>
              <description>ADCBUFE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUFF</name>
          <displayName>ADCBUFF</displayName>
          <description>ADCBUFF</description>
          <addressOffset>0x29e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUFF</name>
              <description>ADCBUFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCON1</name>
          <displayName>ADCON1</displayName>
          <description>ADCON1</description>
          <addressOffset>0x2a0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa3e7</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCON2</name>
          <displayName>ADCON2</displayName>
          <description>ADCON2</description>
          <addressOffset>0x2a2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe4bf</resetMask>
          <fields>
            <field>
              <name>ALTS</name>
              <description>ALTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCON3</name>
          <displayName>ADCON3</displayName>
          <description>ADCON3</description>
          <addressOffset>0x2a4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fbf</resetMask>
          <fields>
            <field>
              <name>ADCS</name>
              <description>ADCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCHS</name>
          <displayName>ADCHS</displayName>
          <description>ADCHS</description>
          <addressOffset>0x2a6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>CH0SA</name>
              <description>CH0SA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPCFG</name>
          <displayName>ADPCFG</displayName>
          <description>ADPCFG</description>
          <addressOffset>0x2a8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PCFG</name>
              <description>PCFG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSSL</name>
          <displayName>ADCSSL</displayName>
          <description>ADCSSL</description>
          <addressOffset>0x2aa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CSSL</name>
              <description>CSSL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISB</name>
          <displayName>TRISB</displayName>
          <description>TRISB</description>
          <addressOffset>0x2c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>TRISB0</name>
              <description>TRISB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTB</name>
          <displayName>PORTB</displayName>
          <description>PORTB</description>
          <addressOffset>0x2c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RB0</name>
              <description>RB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATB</name>
          <displayName>LATB</displayName>
          <description>LATB</description>
          <addressOffset>0x2ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>LATB0</name>
              <description>LATB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISC</name>
          <displayName>TRISC</displayName>
          <description>TRISC</description>
          <addressOffset>0x2cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xe006</resetValue>
          <resetMask>0xe006</resetMask>
          <fields>
            <field>
              <name>TRISC1</name>
              <description>TRISC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTC</name>
          <displayName>PORTC</displayName>
          <description>PORTC</description>
          <addressOffset>0x2ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RC1</name>
              <description>RC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
