xsession/openocd/svd/dspic30f5011.svd
        <register>
          <name>LATC</name>
          <displayName>LATC</displayName>
          <description>LATC</description>
          <addressOffset>0x2d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe006</resetMask>
          <fields>
            <field>
              <name>LATC1</name>
              <description>LATC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISD</name>
          <displayName>TRISD</displayName>
          <description>TRISD</description>
          <addressOffset>0x2d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xfff</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>TRISD0</name>
              <description>TRISD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTD</name>
          <displayName>PORTD</displayName>
          <description>PORTD</description>
          <addressOffset>0x2d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RD0</name>
              <description>RD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATD</name>
          <displayName>LATD</displayName>
          <description>LATD</description>
          <addressOffset>0x2d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>LATD0</name>
              <description>LATD0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISF</name>
          <displayName>TRISF</displayName>
          <description>TRISF</description>
          <addressOffset>0x2de</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7f</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>TRISF0</name>
              <description>TRISF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTF</name>
          <displayName>PORTF</displayName>
          <description>PORTF</description>
          <addressOffset>0x2e0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RF0</name>
              <description>RF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATF</name>
          <displayName>LATF</displayName>
          <description>LATF</description>
          <addressOffset>0x2e2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>LATF0</name>
              <description>LATF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISG</name>
          <displayName>TRISG</displayName>
          <description>TRISG</description>
          <addressOffset>0x2e4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xf3cf</resetValue>
          <resetMask>0xf3cf</resetMask>
          <fields>
            <field>
              <name>TRISG0</name>
              <description>TRISG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTG</name>
          <displayName>PORTG</displayName>
          <description>PORTG</description>
          <addressOffset>0x2e6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RG0</name>
              <description>RG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATG</name>
          <displayName>LATG</displayName>
          <description>LATG</description>
          <addressOffset>0x2e8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf3cf</resetMask>
          <fields>
            <field>
              <name>LATG0</name>
              <description>LATG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF0SID</name>
          <displayName>C1RXF0SID</displayName>
          <description>C1RXF0SID</description>
          <addressOffset>0x300</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF0EIDH</name>
          <displayName>C1RXF0EIDH</displayName>
          <description>C1RXF0EIDH</description>
          <addressOffset>0x302</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF0EIDL</name>
          <displayName>C1RXF0EIDL</displayName>
          <description>C1RXF0EIDL</description>
          <addressOffset>0x304</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1SID</name>
          <displayName>C1RXF1SID</displayName>
          <description>C1RXF1SID</description>
          <addressOffset>0x308</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1EIDH</name>
          <displayName>C1RXF1EIDH</displayName>
          <description>C1RXF1EIDH</description>
          <addressOffset>0x30a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1EIDL</name>
          <displayName>C1RXF1EIDL</displayName>
          <description>C1RXF1EIDL</description>
          <addressOffset>0x30c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2SID</name>
          <displayName>C1RXF2SID</displayName>
          <description>C1RXF2SID</description>
          <addressOffset>0x310</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2EIDH</name>
          <displayName>C1RXF2EIDH</displayName>
          <description>C1RXF2EIDH</description>
          <addressOffset>0x312</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2EIDL</name>
          <displayName>C1RXF2EIDL</displayName>
          <description>C1RXF2EIDL</description>
          <addressOffset>0x314</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3SID</name>
          <displayName>C1RXF3SID</displayName>
          <description>C1RXF3SID</description>
          <addressOffset>0x318</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3EIDH</name>
          <displayName>C1RXF3EIDH</displayName>
          <description>C1RXF3EIDH</description>
          <addressOffset>0x31a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3EIDL</name>
          <displayName>C1RXF3EIDL</displayName>
          <description>C1RXF3EIDL</description>
          <addressOffset>0x31c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4SID</name>
          <displayName>C1RXF4SID</displayName>
          <description>C1RXF4SID</description>
          <addressOffset>0x320</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4EIDH</name>
          <displayName>C1RXF4EIDH</displayName>
          <description>C1RXF4EIDH</description>
          <addressOffset>0x322</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4EIDL</name>
          <displayName>C1RXF4EIDL</displayName>
          <description>C1RXF4EIDL</description>
          <addressOffset>0x324</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5SID</name>
          <displayName>C1RXF5SID</displayName>
          <description>C1RXF5SID</description>
          <addressOffset>0x328</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5EIDH</name>
          <displayName>C1RXF5EIDH</displayName>
          <description>C1RXF5EIDH</description>
          <addressOffset>0x32a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5EIDL</name>
          <displayName>C1RXF5EIDL</displayName>
          <description>C1RXF5EIDL</description>
          <addressOffset>0x32c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM0SID</name>
          <displayName>C1RXM0SID</displayName>
          <description>C1RXM0SID</description>
          <addressOffset>0x330</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>MIDE</name>
              <description>MIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM0EIDH</name>
          <displayName>C1RXM0EIDH</displayName>
          <description>C1RXM0EIDH</description>
          <addressOffset>0x332</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM0EIDL</name>
          <displayName>C1RXM0EIDL</displayName>
          <description>C1RXM0EIDL</description>
          <addressOffset>0x334</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM1SID</name>
          <displayName>C1RXM1SID</displayName>
          <description>C1RXM1SID</description>
          <addressOffset>0x338</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>MIDE</name>
              <description>MIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM1EIDH</name>
          <displayName>C1RXM1EIDH</displayName>
          <description>C1RXM1EIDH</description>
          <addressOffset>0x33a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM1EIDL</name>
          <displayName>C1RXM1EIDL</displayName>
          <description>C1RXM1EIDL</description>
          <addressOffset>0x33c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX2SID</name>
          <displayName>C1TX2SID</displayName>
          <description>C1TX2SID</description>
          <addressOffset>0x340</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXIDE</name>
              <description>TXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX2EID</name>
          <displayName>C1TX2EID</displayName>
          <description>C1TX2EID</description>
          <addressOffset>0x342</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX2DLC</name>
          <displayName>C1TX2DLC</displayName>
          <description>C1TX2DLC</description>
          <addressOffset>0x344</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX2B1</name>
          <displayName>C1TX2B1</displayName>
          <description>C1TX2B1</description>
          <addressOffset>0x346</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB2D0</name>
              <description>TXB2D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX2B2</name>
          <displayName>C1TX2B2</displayName>
          <description>C1TX2B2</description>
          <addressOffset>0x348</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB2D2</name>
              <description>TXB2D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
