xsession/openocd/svd/dspic30f5011.svd
        <register>
          <name>C1TX2B3</name>
          <displayName>C1TX2B3</displayName>
          <description>C1TX2B3</description>
          <addressOffset>0x34a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB2D4</name>
              <description>TXB2D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX2B4</name>
          <displayName>C1TX2B4</displayName>
          <description>C1TX2B4</description>
          <addressOffset>0x34c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB2D6</name>
              <description>TXB2D6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX2CON</name>
          <displayName>C1TX2CON</displayName>
          <description>C1TX2CON</description>
          <addressOffset>0x34e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7b</resetMask>
          <fields>
            <field>
              <name>TXPRI</name>
              <description>TXPRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX1SID</name>
          <displayName>C1TX1SID</displayName>
          <description>C1TX1SID</description>
          <addressOffset>0x350</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXIDE</name>
              <description>TXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX1EID</name>
          <displayName>C1TX1EID</displayName>
          <description>C1TX1EID</description>
          <addressOffset>0x352</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX1DLC</name>
          <displayName>C1TX1DLC</displayName>
          <description>C1TX1DLC</description>
          <addressOffset>0x354</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX1B1</name>
          <displayName>C1TX1B1</displayName>
          <description>C1TX1B1</description>
          <addressOffset>0x356</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D0</name>
              <description>TXB1D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX1B2</name>
          <displayName>C1TX1B2</displayName>
          <description>C1TX1B2</description>
          <addressOffset>0x358</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D2</name>
              <description>TXB1D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX1B3</name>
          <displayName>C1TX1B3</displayName>
          <description>C1TX1B3</description>
          <addressOffset>0x35a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D4</name>
              <description>TXB1D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX1B4</name>
          <displayName>C1TX1B4</displayName>
          <description>C1TX1B4</description>
          <addressOffset>0x35c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D6</name>
              <description>TXB1D6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX1CON</name>
          <displayName>C1TX1CON</displayName>
          <description>C1TX1CON</description>
          <addressOffset>0x35e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7b</resetMask>
          <fields>
            <field>
              <name>TXPRI</name>
              <description>TXPRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX0SID</name>
          <displayName>C1TX0SID</displayName>
          <description>C1TX0SID</description>
          <addressOffset>0x360</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXIDE</name>
              <description>TXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX0EID</name>
          <displayName>C1TX0EID</displayName>
          <description>C1TX0EID</description>
          <addressOffset>0x362</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX0DLC</name>
          <displayName>C1TX0DLC</displayName>
          <description>C1TX0DLC</description>
          <addressOffset>0x364</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX0B1</name>
          <displayName>C1TX0B1</displayName>
          <description>C1TX0B1</description>
          <addressOffset>0x366</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D0</name>
              <description>TXB0D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX0B2</name>
          <displayName>C1TX0B2</displayName>
          <description>C1TX0B2</description>
          <addressOffset>0x368</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D2</name>
              <description>TXB0D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX0B3</name>
          <displayName>C1TX0B3</displayName>
          <description>C1TX0B3</description>
          <addressOffset>0x36a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D4</name>
              <description>TXB0D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX0B4</name>
          <displayName>C1TX0B4</displayName>
          <description>C1TX0B4</description>
          <addressOffset>0x36c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D6</name>
              <description>TXB0D6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TX0CON</name>
          <displayName>C1TX0CON</displayName>
          <description>C1TX0CON</description>
          <addressOffset>0x36e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7b</resetMask>
          <fields>
            <field>
              <name>TXPRI</name>
              <description>TXPRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX1SID</name>
          <displayName>C1RX1SID</displayName>
          <description>C1RX1SID</description>
          <addressOffset>0x370</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXIDE</name>
              <description>RXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX1EID</name>
          <displayName>C1RX1EID</displayName>
          <description>C1RX1EID</description>
          <addressOffset>0x372</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX1DLC</name>
          <displayName>C1RX1DLC</displayName>
          <description>C1RX1DLC</description>
          <addressOffset>0x374</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX1B1</name>
          <displayName>C1RX1B1</displayName>
          <description>C1RX1B1</description>
          <addressOffset>0x376</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D0</name>
              <description>TXB1D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX1B2</name>
          <displayName>C1RX1B2</displayName>
          <description>C1RX1B2</description>
          <addressOffset>0x378</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D2</name>
              <description>TXB1D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX1B3</name>
          <displayName>C1RX1B3</displayName>
          <description>C1RX1B3</description>
          <addressOffset>0x37a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D4</name>
              <description>TXB1D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX1B4</name>
          <displayName>C1RX1B4</displayName>
          <description>C1RX1B4</description>
          <addressOffset>0x37c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D6</name>
              <description>TXB1D6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX1CON</name>
          <displayName>C1RX1CON</displayName>
          <description>C1RX1CON</description>
          <addressOffset>0x37e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8f</resetMask>
          <fields>
            <field>
              <name>FILHIT</name>
              <description>FILHIT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX0SID</name>
          <displayName>C1RX0SID</displayName>
          <description>C1RX0SID</description>
          <addressOffset>0x380</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXIDE</name>
              <description>RXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX0EID</name>
          <displayName>C1RX0EID</displayName>
          <description>C1RX0EID</description>
          <addressOffset>0x382</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX0DLC</name>
          <displayName>C1RX0DLC</displayName>
          <description>C1RX0DLC</description>
          <addressOffset>0x384</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX0B1</name>
          <displayName>C1RX0B1</displayName>
          <description>C1RX0B1</description>
          <addressOffset>0x386</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D0</name>
              <description>TXB0D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX0B2</name>
          <displayName>C1RX0B2</displayName>
          <description>C1RX0B2</description>
          <addressOffset>0x388</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D2</name>
              <description>TXB0D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX0B3</name>
          <displayName>C1RX0B3</displayName>
          <description>C1RX0B3</description>
          <addressOffset>0x38a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D4</name>
              <description>TXB0D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX0B4</name>
          <displayName>C1RX0B4</displayName>
          <description>C1RX0B4</description>
          <addressOffset>0x38c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D6</name>
              <description>TXB0D6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RX0CON</name>
          <displayName>C1RX0CON</displayName>
          <description>C1RX0CON</description>
          <addressOffset>0x38e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8f</resetMask>
          <fields>
            <field>
              <name>FILHIT0</name>
              <description>FILHIT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CTRL</name>
          <displayName>C1CTRL</displayName>
          <description>C1CTRL</description>
          <addressOffset>0x390</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x480</resetValue>
          <resetMask>0xffee</resetMask>
          <fields>
            <field>
              <name>ICODE</name>
              <description>ICODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CFG1</name>
          <displayName>C1CFG1</displayName>
          <description>C1CFG1</description>
          <addressOffset>0x392</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>BRP</name>
              <description>BRP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CFG2</name>
          <displayName>C1CFG2</displayName>
          <description>C1CFG2</description>
          <addressOffset>0x394</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PRSEG</name>
              <description>PRSEG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1INTF</name>
          <displayName>C1INTF</displayName>
          <description>C1INTF</description>
          <addressOffset>0x396</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXB0IF</name>
              <description>RXB0IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
