xsession/openocd/svd/dspic30f5011.svd
        <register>
          <name>C1INTE</name>
          <displayName>C1INTE</displayName>
          <description>C1INTE</description>
          <addressOffset>0x398</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>RXB0IE</name>
              <description>RXB0IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1EC</name>
          <displayName>C1EC</displayName>
          <description>C1EC</description>
          <addressOffset>0x39a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>REC</name>
              <description>REC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF0SID</name>
          <displayName>C2RXF0SID</displayName>
          <description>C2RXF0SID</description>
          <addressOffset>0x3c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF0EIDH</name>
          <displayName>C2RXF0EIDH</displayName>
          <description>C2RXF0EIDH</description>
          <addressOffset>0x3c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF0EIDL</name>
          <displayName>C2RXF0EIDL</displayName>
          <description>C2RXF0EIDL</description>
          <addressOffset>0x3c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF1SID</name>
          <displayName>C2RXF1SID</displayName>
          <description>C2RXF1SID</description>
          <addressOffset>0x3c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF1EIDH</name>
          <displayName>C2RXF1EIDH</displayName>
          <description>C2RXF1EIDH</description>
          <addressOffset>0x3ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF1EIDL</name>
          <displayName>C2RXF1EIDL</displayName>
          <description>C2RXF1EIDL</description>
          <addressOffset>0x3cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF2SID</name>
          <displayName>C2RXF2SID</displayName>
          <description>C2RXF2SID</description>
          <addressOffset>0x3d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF2EIDH</name>
          <displayName>C2RXF2EIDH</displayName>
          <description>C2RXF2EIDH</description>
          <addressOffset>0x3d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF2EIDL</name>
          <displayName>C2RXF2EIDL</displayName>
          <description>C2RXF2EIDL</description>
          <addressOffset>0x3d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF3SID</name>
          <displayName>C2RXF3SID</displayName>
          <description>C2RXF3SID</description>
          <addressOffset>0x3d8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF3EIDH</name>
          <displayName>C2RXF3EIDH</displayName>
          <description>C2RXF3EIDH</description>
          <addressOffset>0x3da</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF3EIDL</name>
          <displayName>C2RXF3EIDL</displayName>
          <description>C2RXF3EIDL</description>
          <addressOffset>0x3dc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF4SID</name>
          <displayName>C2RXF4SID</displayName>
          <description>C2RXF4SID</description>
          <addressOffset>0x3e0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EXIDE</name>
              <description>EXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF4EIDH</name>
          <displayName>C2RXF4EIDH</displayName>
          <description>C2RXF4EIDH</description>
          <addressOffset>0x3e2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF4EIDL</name>
          <displayName>C2RXF4EIDL</displayName>
          <description>C2RXF4EIDL</description>
          <addressOffset>0x3e4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF5EIDH</name>
          <displayName>C2RXF5EIDH</displayName>
          <description>C2RXF5EIDH</description>
          <addressOffset>0x3ea</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF5EIDL</name>
          <displayName>C2RXF5EIDL</displayName>
          <description>C2RXF5EIDL</description>
          <addressOffset>0x3ec</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM0SID</name>
          <displayName>C2RXM0SID</displayName>
          <description>C2RXM0SID</description>
          <addressOffset>0x3f0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>MIDE</name>
              <description>MIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM0EIDL</name>
          <displayName>C2RXM0EIDL</displayName>
          <description>C2RXM0EIDL</description>
          <addressOffset>0x3f4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM1SID</name>
          <displayName>C2RXM1SID</displayName>
          <description>C2RXM1SID</description>
          <addressOffset>0x3f8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>MIDE</name>
              <description>MIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM1EIDH</name>
          <displayName>C2RXM1EIDH</displayName>
          <description>C2RXM1EIDH</description>
          <addressOffset>0x3fa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM1EIDL</name>
          <displayName>C2RXM1EIDL</displayName>
          <description>C2RXM1EIDL</description>
          <addressOffset>0x3fc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX2SID</name>
          <displayName>C2TX2SID</displayName>
          <description>C2TX2SID</description>
          <addressOffset>0x400</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXIDE</name>
              <description>TXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX2EID</name>
          <displayName>C2TX2EID</displayName>
          <description>C2TX2EID</description>
          <addressOffset>0x402</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX2DLC</name>
          <displayName>C2TX2DLC</displayName>
          <description>C2TX2DLC</description>
          <addressOffset>0x404</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX2B1</name>
          <displayName>C2TX2B1</displayName>
          <description>C2TX2B1</description>
          <addressOffset>0x406</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB2D0</name>
              <description>TXB2D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX2B2</name>
          <displayName>C2TX2B2</displayName>
          <description>C2TX2B2</description>
          <addressOffset>0x408</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB2D2</name>
              <description>TXB2D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX2B3</name>
          <displayName>C2TX2B3</displayName>
          <description>C2TX2B3</description>
          <addressOffset>0x40a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB2D4</name>
              <description>TXB2D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX2B4</name>
          <displayName>C2TX2B4</displayName>
          <description>C2TX2B4</description>
          <addressOffset>0x40c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB2D6</name>
              <description>TXB2D6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX2CON</name>
          <displayName>C2TX2CON</displayName>
          <description>C2TX2CON</description>
          <addressOffset>0x40e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7b</resetMask>
          <fields>
            <field>
              <name>TXPRI</name>
              <description>TXPRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX1SID</name>
          <displayName>C2TX1SID</displayName>
          <description>C2TX1SID</description>
          <addressOffset>0x410</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXIDE</name>
              <description>TXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX1EID</name>
          <displayName>C2TX1EID</displayName>
          <description>C2TX1EID</description>
          <addressOffset>0x412</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX1DLC</name>
          <displayName>C2TX1DLC</displayName>
          <description>C2TX1DLC</description>
          <addressOffset>0x414</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX1B1</name>
          <displayName>C2TX1B1</displayName>
          <description>C2TX1B1</description>
          <addressOffset>0x416</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D0</name>
              <description>TXB1D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX1B2</name>
          <displayName>C2TX1B2</displayName>
          <description>C2TX1B2</description>
          <addressOffset>0x418</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D2</name>
              <description>TXB1D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX1B3</name>
          <displayName>C2TX1B3</displayName>
          <description>C2TX1B3</description>
          <addressOffset>0x41a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D4</name>
              <description>TXB1D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX1B4</name>
          <displayName>C2TX1B4</displayName>
          <description>C2TX1B4</description>
          <addressOffset>0x41c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D6</name>
              <description>TXB1D6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
