xsession/openocd/svd/dspic30f5011.svd
        <register>
          <name>C2TX1CON</name>
          <displayName>C2TX1CON</displayName>
          <description>C2TX1CON</description>
          <addressOffset>0x41e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7b</resetMask>
          <fields>
            <field>
              <name>TXPRI</name>
              <description>TXPRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX0SID</name>
          <displayName>C2TX0SID</displayName>
          <description>C2TX0SID</description>
          <addressOffset>0x420</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXIDE</name>
              <description>TXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX0EID</name>
          <displayName>C2TX0EID</displayName>
          <description>C2TX0EID</description>
          <addressOffset>0x422</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX0DLC</name>
          <displayName>C2TX0DLC</displayName>
          <description>C2TX0DLC</description>
          <addressOffset>0x424</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX0B1</name>
          <displayName>C2TX0B1</displayName>
          <description>C2TX0B1</description>
          <addressOffset>0x426</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D0</name>
              <description>TXB0D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX0B2</name>
          <displayName>C2TX0B2</displayName>
          <description>C2TX0B2</description>
          <addressOffset>0x428</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D2</name>
              <description>TXB0D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX0B3</name>
          <displayName>C2TX0B3</displayName>
          <description>C2TX0B3</description>
          <addressOffset>0x42a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D4</name>
              <description>TXB0D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX0B4</name>
          <displayName>C2TX0B4</displayName>
          <description>C2TX0B4</description>
          <addressOffset>0x42c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D6</name>
              <description>TXB0D6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TX0CON</name>
          <displayName>C2TX0CON</displayName>
          <description>C2TX0CON</description>
          <addressOffset>0x42e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7b</resetMask>
          <fields>
            <field>
              <name>TXPRI</name>
              <description>TXPRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX1SID</name>
          <displayName>C2RX1SID</displayName>
          <description>C2RX1SID</description>
          <addressOffset>0x430</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXIDE</name>
              <description>RXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX1EID</name>
          <displayName>C2RX1EID</displayName>
          <description>C2RX1EID</description>
          <addressOffset>0x432</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX1DLC</name>
          <displayName>C2RX1DLC</displayName>
          <description>C2RX1DLC</description>
          <addressOffset>0x434</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX1B1</name>
          <displayName>C2RX1B1</displayName>
          <description>C2RX1B1</description>
          <addressOffset>0x436</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D0</name>
              <description>TXB1D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX1B2</name>
          <displayName>C2RX1B2</displayName>
          <description>C2RX1B2</description>
          <addressOffset>0x438</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D2</name>
              <description>TXB1D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX1B3</name>
          <displayName>C2RX1B3</displayName>
          <description>C2RX1B3</description>
          <addressOffset>0x43a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D4</name>
              <description>TXB1D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX1B4</name>
          <displayName>C2RX1B4</displayName>
          <description>C2RX1B4</description>
          <addressOffset>0x43c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB1D6</name>
              <description>TXB1D6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX1CON</name>
          <displayName>C2RX1CON</displayName>
          <description>C2RX1CON</description>
          <addressOffset>0x43e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8f</resetMask>
          <fields>
            <field>
              <name>FILHIT</name>
              <description>FILHIT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX0SID</name>
          <displayName>C2RX0SID</displayName>
          <description>C2RX0SID</description>
          <addressOffset>0x440</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXIDE</name>
              <description>RXIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX0EID</name>
          <displayName>C2RX0EID</displayName>
          <description>C2RX0EID</description>
          <addressOffset>0x442</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID6</name>
              <description>EID6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX0DLC</name>
          <displayName>C2RX0DLC</displayName>
          <description>C2RX0DLC</description>
          <addressOffset>0x444</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX0B1</name>
          <displayName>C2RX0B1</displayName>
          <description>C2RX0B1</description>
          <addressOffset>0x446</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D0</name>
              <description>TXB0D0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX0B2</name>
          <displayName>C2RX0B2</displayName>
          <description>C2RX0B2</description>
          <addressOffset>0x448</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D2</name>
              <description>TXB0D2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX0B3</name>
          <displayName>C2RX0B3</displayName>
          <description>C2RX0B3</description>
          <addressOffset>0x44a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TXB0D4</name>
              <description>TXB0D4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RX0CON</name>
          <displayName>C2RX0CON</displayName>
          <description>C2RX0CON</description>
          <addressOffset>0x44e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8f</resetMask>
          <fields>
            <field>
              <name>FILHIT0</name>
              <description>FILHIT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CTRL</name>
          <displayName>C2CTRL</displayName>
          <description>C2CTRL</description>
          <addressOffset>0x450</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x480</resetValue>
          <resetMask>0xffee</resetMask>
          <fields>
            <field>
              <name>ICODE</name>
              <description>ICODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CFG1</name>
          <displayName>C2CFG1</displayName>
          <description>C2CFG1</description>
          <addressOffset>0x452</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>BRP</name>
              <description>BRP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CFG2</name>
          <displayName>C2CFG2</displayName>
          <description>C2CFG2</description>
          <addressOffset>0x454</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PRSEG</name>
              <description>PRSEG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2INTE</name>
          <displayName>C2INTE</displayName>
          <description>C2INTE</description>
          <addressOffset>0x458</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>RXB0IE</name>
              <description>RXB0IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2EC</name>
          <displayName>C2EC</displayName>
          <description>C2EC</description>
          <addressOffset>0x45a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>REC</name>
              <description>REC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCON</name>
          <displayName>RCON</displayName>
          <description>RCON</description>
          <addressOffset>0x740</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x210</resetValue>
          <resetMask>0x354</resetMask>
          <fields>
            <field>
              <name>POR</name>
              <description>POR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCON</name>
          <displayName>OSCCON</displayName>
          <description>OSCCON</description>
          <addressOffset>0x742</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xcceb</resetMask>
          <fields>
            <field>
              <name>OSWEN</name>
              <description>OSWEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRAM</name>
          <displayName>BSRAM</displayName>
          <description>BSRAM</description>
          <addressOffset>0x750</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>RL_BSR</name>
              <description>RL_BSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSRAM</name>
          <displayName>SSRAM</displayName>
          <description>SSRAM</description>
          <addressOffset>0x752</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>RL_SSR</name>
              <description>RL_SSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCON</name>
          <displayName>NVMCON</displayName>
          <description>NVMCON</description>
          <addressOffset>0x760</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe17f</resetMask>
          <fields>
            <field>
              <name>PROGOP</name>
              <description>PROGOP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADR</name>
          <displayName>NVMADR</displayName>
          <description>NVMADR</description>
          <addressOffset>0x762</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>NVMADR</name>
              <description>NVMADR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADRU</name>
          <displayName>NVMADRU</displayName>
          <description>NVMADRU</description>
          <addressOffset>0x764</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>NVMADR</name>
              <description>NVMADR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMKEY</name>
          <displayName>NVMKEY</displayName>
          <description>NVMKEY</description>
          <addressOffset>0x766</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD1</name>
          <displayName>PMD1</displayName>
          <description>PMD1</description>
          <addressOffset>0x770</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf9ff</resetMask>
          <fields>
            <field>
              <name>ADCMD</name>
              <description>ADCMD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD2</name>
          <displayName>PMD2</displayName>
          <description>PMD2</description>
          <addressOffset>0x772</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OC1MD</name>
              <description>OC1MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>